// pages/profile/static/service.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    item: {}
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    const data = {
      title: 'Cheerfish服务协议提示条款',
      content1: '\n更新日期：2019年7月10日\n生效日期：2019年7月10日\n\n欢迎您阅读《巧鱼服务协议》（“本协议”）！\n       本协议适用于巧鱼（Cheerfish，全文称“巧鱼”）提供的所有产品和服务。巧鱼服务提供者（“我们”）提醒您，为维护您的权利，在使用巧鱼各项产品或服务前，请您务必审慎阅读并透彻理解本协议各条款内容。如您对本协议有任何疑问、意见或建议，请通过本协议提供的联系方式及时与我们联系。\n       在确认充分理解并同意后，您可以使用巧鱼的产品或服务。当您开始使用巧鱼的产品或服务时，即表示您已充分理解并同意本协议。在阅读本协议、使用巧鱼的产品或服务的过程中，如果您不同意本协议中的任一条款，您可立即停止使用巧鱼的产品或服务。\n       第一部分 定义\n 巧鱼：指巧鱼向用户提供服务的产品载体（包括并不限于小程序/APP/网站 / 公众号等）。\n       巧鱼服务提供者：指巧鱼的网络及软件技术服务提供者清控汉邑数据科技（北京）有限公司及关联公司。\n       除另有约定外，本协议所用定义与 ',
      content2: '中的定义具有相同的涵义。\n       第二部分 服务协议\n 本服务协议将包含以下内容：\n       一、注册和使用\n 二、用户信息的提供、保护和保证、授权\n 三、巧鱼服务使用规则\n 四、不可抗力及其他免责事由\n 五、未成年人条款\n 六、适用及变更\n 七、管辖及法律应用\n 八、如何联系我们\n 一、注册和使用\n     （一）用户资格\n     请确认，在您开始注册程序使用巧鱼服务前，您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力。若您不具备前述与您行为相适应的民事行为能力，则您及您的监护人应依照法律规定承担因此而导致的后果。\n     此外，您还需确保您不是任何国家、国际组织或者地域实施的贸易限制、制裁或其他法律、规则限制的对象。\n     （二）账户说明\n     1、账户获得\n     当您阅读并同意本协议，且按照提示完成全部注册程序后，您可获得巧鱼账户。\n     如巧鱼系统判断您存在不当注册或不当使用账户的情形，我们可采取封禁账户等措施。\n     2、账户使用\n     您有权使用您设置或确认的手机号码等（“账户名称”）及您设置的密码（账户名称及密码合称“账户”）或授权的微信等登录巧鱼。\n     由于您的账户关联您的个人信息，您的账户仅限您本人使用。您享有您账户的使用权。我们享有账户的所有权。在使用中，您不应以任何方式私自转让该使用权，也不应以任何形式盗用他人账户。账户的行为将被视为账户注册用户的行为。\n     如您账户的使用可能危及您的账户安全及 / 或其他用户信息安全的，我们可采取相应安全措施。\n     3、账户安全\n     您的账户为您自行设置并由您保管，我们在任何时候均不会主动要求您提供您的账户密码。我们强烈建议您务必保管好您的账户。账户因您主动泄露或因您遭受他人攻击、诈骗等行为导致的损失及后果，您应通过司法、行政等救济途径向侵权行为人追偿。此外，您应对您账户项下的所有行为结果（包括但不限于发布信息、评论）负责。\n     4、日常维护\n     如发现任何未经授权使用您账户登录巧鱼或其他可能导致您账户遭窃、遗失的情况，建议您立即通知我们，并授权我们为保护您的账户信息采取相应措施。请理解，我们对您的任何请求采取行动均需要合理时间，且应您请求而采取的行动可能无法避免或阻止侵害后果的形成或扩大。\n     二、用户信息的提供、保护和保证、授权\n     （一）用户信息的提供、保护\n     1、信息的真实合法和更新\n     在使用巧鱼服务时，需要您按页面的提示准确完整地提供您的信息（包括您的姓名、联系电话等）。您了解并同意，您应提供真实且有效的信息。\n     为给您提供更好的服务，需要您及时更新您提供的信息。在法律有明确规定要求平台服务提供者必须对用户信息进行核实的情况下，我们将依法进行检查核实，需要您配合提供最新、真实、完整、有效的信息。\n     如您未及时提供信息、您提供的信息存在明显不实或行政司法机关核实您提供的信息无效的，您将承担因此对您自身、他人等造成的损失与后果。我们可能向您发出询问通知，并要求您进行重新认证，直至中止、终止对您提供部分或全部巧鱼服务。请您理解，为提高您通过认证的效率，如您申请认证时填写的“姓名”、“公司”、“职位”、“学校”、“班级”等信息与主动提交的“认证资料”中信息不一致，系统将根据您主动提供的认证资料调整，使“姓名”、“公司”、“职位” 、“学校”、“班级”等与“认证资料”中保持一致。\n     2、用户信息的保护\n     保护用户信息是我们的一项基本原则。我们将按照本协议及 ',
      content3: '的规定收集、使用、储存和分享您的个人信息。本协议对信息保护相关内容未作明确规定的，均以 ',
      content4: '的内容为准。\n     （二）用户信息的保证、授权\n     1、用户信息的保证\n     为了维护互联网环境，保护权利人相应的权利，请您声明并保证，您对您所发布的信息拥有相应、合法的权利。否则，我们可对您发布的信息依法或依本协议采取删除或屏蔽等措施，以减轻因不当行为而造成的影响。\n     您应当确保您所发布的信息不包含以下内容：\n     （1）违反国家法律法规禁止性规定的；\n     （2）封建迷信、淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；\n     （3）欺诈、虚假、不准确或存在误导性的；\n     （4）侵犯他人知识产权或涉及第三方商业秘密及其他专有权利的；\n     （5）侮辱、诽谤、恐吓、涉及他人隐私等侵害他人合法权益的；\n     （6）存在可能破坏、篡改、删除、影响巧鱼系统正常运行或未经授权秘密获取巧鱼及其他用户的数据、个人资料的病毒、木马、爬虫等恶意软件、程序代码的；\n     （7）其他违背社会公共利益或公共道德不适合在巧鱼上发布的。\n     2、用户信息的授权\n     对于您提供、发布及在使用巧鱼服务中形成的除个人信息外的文字、图片、视频、音频等非个人信息，在法律规定的保护期限内您免费授予我们获得全球排他的许可使用权利及再授权给其他第三方使用并可以自身名义对第三方侵权行为取证及提起诉讼的权利。请确认，您同意我们存储、使用、复制、修订、编辑、发布、展示、翻译、分发您的非个人信息或制作其派生作品，并以已知或日后开发的形式、媒体或技术将上述信息纳入其它作品内。\n     为方便您使用巧鱼的其他相关服务，请您授权我们将您在账户注册和使用巧鱼服务过程中提供、形成的信息传递给其他相关服务提供者，或从其他相关服务提供者获取您在注册、使用相关服务期间提供、形成的信息。\n     三、巧鱼服务使用规则\n     （一）在使用巧鱼的产品或服务过程中，您应当遵守如下规则：\n     1、遵守中国法律、法规、行政规章及规范性文件；\n     2、遵守与巧鱼服务有关的协议、政策等文件；\n     3、不应为任何违法、犯罪目的而使用巧鱼服务；\n     4、不应以任何形式侵犯任何第三方的合法权利；\n     5、不应进行任何可能对互联网正常运转造成不利影响的行为。\n     对于您上传到巧鱼网站或平台的任何文本、图片、图形、音频和 / 或视频等，或您的其他使用行为，我们将依据法律法规的规定，保留对其内容监督的权利。\n     （二）知识产权条款\n     我们提供的与巧鱼的产品或服务相关的各种类的过去有效的、现行有效的、或即将产生的权利归巧鱼服务提供者所有，包括但不限于专利权、商标权、著作权及其他知识产权以及相关申请的权利。未经巧鱼服务提供者书面许可，任何人不得以任何形式使用或创造相关衍生作品，或用于其他任何商业目的。\n     （三）用户行为违约及处理\n     1、在使用巧鱼的产品或服务时，如您有如下情形之一的，视为违约：\n     （1）违反法律法规等相关规定的；\n     （2）违反本协议、 ',
      content5: '等约定的；\n     2、请确认，您对巧鱼产品或服务的使用承担独立且完全的法律责任。如您有违约行为，相关国家机关或机构可能会对您提起诉讼、罚款或采取其他制裁措施，并要求我们给予协助。因此造成损害的（包括但不限于直接经济损失、商誉损失及支出的赔偿金、律师费、诉讼费等间接经济损失），您应承担全部责任。\n     此外，我们保留对您的使用等行为进行监督的权利。如您被投诉或被发现有违约行为，为及时解决问题，保护各方合法权利，我们可以独立判断并采取相应措施（包括但不限于通过技术手段删除、屏蔽相关内容或断开链接、暂停或中止向您提供服务等）。\n     （四）服务的变更、中断、终止\n     1、请您理解并同意，我们基于经营策略的调整，可能会对服务内容进行变更，也可能会中断、中止或终止服务。\n     2、如发生下列任何一种情形，我们有权中断或终止向您提供服务：\n     （1）根据法律法规规定，您应提交真实信息，而您提供的信息不真实、或与注册时信息不一致又未能提供合理证明。\n     （2）您违反相关法律法规的规定、违反 ',
      content6: '或违反本协议的约定。\n     （3）按照法律法规规定，司法机关或主管部门的要求。\n     （4）出于安全的原因或其他必要的情形。\n     3、您有责任自行备份存储在使用服务中的数据。如果您的服务被终止，我们有权从服务器上永久地删除您的数据, 法律法规另有规定的除外。服务中止或终止后，我们没有义务向您提供或返还数据。\n     （五）我们可能发送的信息\n     1、请确认，我们可能自行或由第三方通过短信、电子邮件或电子信息等多种方式向您发送、展示广告或其他信息（包括商业与非商业信息），广告或其他信息的具体发送及展示形式、频次及内容等以实际提供为准。如您不希望收到这些信息，可以按照我们的相关提示，在设备上选择取消订阅。\n     2、我们将依照相关法律法规要求开展广告业务。对巧鱼的产品或服务中出现的广告，您应审慎判断其真实性和可靠性，除法律明确规定外，您应对因该广告而实施的行为负责。\n     3、我们可能在必要时（例如因系统维护而暂停某一项服务时）向您发出与服务有关的公告。您可能无法取消这些与服务有关、性质不属于推广的公告。\n     四、不可抗力及其他免责事由\n     （一）在使用巧鱼的产品或服务的过程中，可能会遇到不可抗力等风险因素，使产品或服务受到影响。不可抗力是指不能预见、不能克服并不能避免且造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。出现上述情况时，我们将努力在第一时间与相关单位配合，争取及时进行处理，但是由此给您造成的损失在法律允许的范围内免责。\n     （二）在法律允许的范围内，我们对以下情形导致的服务中断或受阻、损失等后果不承担责任：\n     1、受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏。\n     2、您或我们的电脑软件、系统、硬件和通信线路出现故障。\n     3、由您的操作不当或通过违法违规、非授权的方式使用本服务。\n     4、程序版本过时、设备的老化和 / 或其兼容性问题、系统不稳定问题。\n     5、其他我们无法控制或合理预见的情形。\n     （三）在使用巧鱼服务的过程中，可能会遇到网络信息或其他用户行为带来的风险，可能会遇到其他用户损害合法权利（包括但不仅限于知识产权）的行为，我们不对任何信息的准确性、真实性、适用性、合法性作承诺保证或承担责任，也不对因用户的侵权行为造成的损害负责。这些风险包括但不限于：\n     1、来自他人匿名或冒名的含有威胁、诽谤、令人反感或非法内容的信息。\n     2、遭受他人误导、欺骗或其他导致或可能导致的任何心理、生理上的伤害以及经济上的损失。\n     3、其他因网络信息或用户行为引起的风险。\n     （四）我们对第三方依托巧鱼提供的内容或服务等无法做承诺或保证，对因前述未作承诺或保证的内容或服务等可能或将导致的直接、间接、偶然、特殊及后续损害，在法律允许的范围内免责。\n     （五）我们依据本协议约定获得处理违法违规内容的权利，该权利不构成我们的义务或承诺，请理解，由于用户行为的不可控性，我们不能保证及时发现违法行为或进行相应处理。\n     （六）在任何情况下，我们强烈建议您不轻信借款、索要密码或其他涉及财产的信息。涉及财产操作的，请一定先核实对方身份。\n     五、未成年人条款\n     如您为未成年人，我们要求您请您的父母或监护人仔细阅读本协议，并在征得您的父母或监护人同意的前提下使用我们的服务。\n     六、适用及变更\n     （一）适用范围\n     1、我们的所有服务均适用本协议。\n     2、某些服务有其特定的规则或协议，该规则或协议会针对相应的服务有更具体的说明，如本协议与特定服务的规则或协议有不一致之处，请以该规则或协议为准。\n     3、请您注意，本协议不适用由其他公司或个人提供的服务。您使用该等第三方服务需受其服务协议（而非本协议）的约束，需要您仔细阅读其协议内容。\n     （二）变更\n     1、未经您明确同意，我们不会限制您按照本协议所应享有的权利。\n     2、对于重大变更（包括但不限于我们的服务模式发生重大变化），我们还会提供更为显著的通知。在该种情况下，若您继续使用我们的服务，即表示同意受经修订的协议约束。若您不接受修改后的最新协议条款，可立即停止使用巧鱼服务，或注销账户。\n     七、管辖及法律适用\n     1、本协议的成立、生效、履行、解释及因本协议产生的任何争议，均适用中华人民共和国法律（不包括港澳台地区法律）。如法律无相关规定的，参照商业惯例及 / 或行业惯例。\n     2、您因使用巧鱼产品或服务所产生的与巧鱼服务有关的任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交清控汉邑数据科技（北京）有限公司所在地有管辖权的人民法院管辖。\n     3、本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。\n     4、本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效。\n     八、如何联系我们\n     本协议的最终解释权及修改权归巧鱼服务提供者所有。若有如下情形，您可以通过巧鱼小程序或APP中【我的 - 联系客服或联系我们】或发送邮件至【service@hanstate.com】与我们联系，我们将在【10】个工作日内回复您：\n     1、如对本协议内容有任何疑问、意见或建议；\n     2、如对巧鱼的产品和服务有任何疑问、意见或建议。\n ',
      
    }
    this.setData({ item: data })
    wx.hideShareMenu()
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  },

  toMenuForPrivacy: function () {
    wx.navigateTo({
      url: "/pages/profile/static/privacy"
    })
  },

})